---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementShowNormalPlaneOnly
source: html/ceb88711-832a-cc0b-70d5-d1ae419c1e01.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementShowNormalPlaneOnly Property

"Show Normal Reference Plane Only"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementShowNormalPlaneOnly { get; }
```